<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}


}

</style>

<b><center>
    <span style="font-size: 24pt; line-height: 1.2;">COMS W4111: Introduction to Databases</span><br>
    <span style="font-size: 24pt; line-height: 1.2;">Section 002, Spring, 2020</span><br>
</center></b>
<br><br>
<i><center>
<span style="font-size: 20pt; line-height: 1.2;">Lecture 7: SQL, App, Projects</span>
</center></i>

# Lecture Material

- The lecture material is on the site and repository.


- This Jupyter notebook is for running example code and sample applications.

# Set Up Environment

In [1]:
load_ext sql

In [7]:
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/lahmansbaseballdb

'Connected: dbuser@lahmansbaseballdb'

In [3]:
%sql select * from people where playerid='willite01';

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
1 rows affected.

[('willite01', 1918, 8, 30, 'USA', 'CA', 'San Diego', 2002, 7, 5, 'USA', 'FL', 'Inverness', 'Ted', 'Williams', 'Theodore Samuel', 205, 75, 'L', 'R', '1939-04-20', '1960-09-28', 'willt103', 'willite01', datetime.date(1918, 8, 30), datetime.date(1939, 4, 20), datetime.date(1960, 9, 28), datetime.date(2002, 7, 5))]

# HW3, HW4: Project $-$ Analysis System

## Examples from PPT

- Building the player-year performance summaries.

In [ ]:
%%sql

use aaaaaFantasyBaseball;

drop table if exists aaaaaFantasyBaseball.player_performance_year;

create table aaaaaFantasyBaseball.player_performance_year as
    with player_basic
    as
    (
        select playerID, nameLast, nameFirst, bats, throws from people
    ),
     player_appearances_year as
     (
         select
            playerid, yearid, sum(g_all) as app_g_all, sum(gs) as app_g_s, sum(g_defense) as app_g_defense,
            sum(g_p) as app_g_p, sum(g_c) as app_g_c, sum(g_1b) as app_g_1b, sum(g_2b) as app_g_2b,
                sum(g_3b) as app_g_3b, sum(g_ss), sum(g_lf) as app_g_lf, sum(g_cf) as app_g_cf,
                    sum(g_rf) as app_g_rf
         from appearances group by playerid, yearid
     ),
     player_batting_year
    as
     (
         select playerid, yearid, sum(g) as bat_g, sum(g_batting) as g_batting,
                sum(ab) as bat_ab, sum(r) as bat_r, sum(h) bat_h,
                sum(h-`2b`-`3b`-hr) as bat_1, sum(`2b`) as bat_2, sum(`3b`) as bat_3,
                sum(hr) as bat_hr, sum(rbi) as bat_rbi, sum(sh) as bat_sh, sum(sf) as bat_sf,
               sum(`2b`) as b2, sum(`3b`) as b3, sum(hr) as hr, sum(bb) as bb
        from batting group by playerid, yearid
    ),
    player_pitching_year
    as
        (
        select playerid, yearid, sum(w) as p_w, sum(l) as p_l, sum(g) as p_g, sum(IPOuts) as p_IPOuts,
            sum(SV) as p_SV, sum(h) as p_h, sum(hr) as p_hr, sum(bb) as p_bb, sum(er) as p_er
            from pitching group by playerid, yearid
             )
select * from
	(select * from player_appearances_year left join player_batting_year using(playerid, yearid)) as x
    left join
    player_pitching_year using(playerid, yearid);

- Compute salary normalization information ...

In [ ]:
%%sql

drop table if exists aaaaaFantasyBaseball.normalized_salary_averages;

create table aaaaaFantasyBaseball.normalized_salary_averages as 
with annual_average_salary as
    (
        select yearid, round(avg(salary),0) as avg_salary from
            lahmansbaseballdb.salaries group by yearid
    ),
normalized_averages as
         (
             select yearid, avg_salary, cpi.value  as salary_factor,
                    round((avg_salary / cpi.value), 0) as normalized_avg_salary
             from annual_average_salary
                    join cpi on yearid=cpi.CPI_US_I
         ),
averages_and_yoy as
    (
        select a.yearid, a.avg_salary, a.salary_factor, b.avg_salary as prior_avg_salary,
               b.salary_factor as prior_salary_factor
            from normalized_averages as a join normalized_averages as b
                on a.yearid=b.yearid+1
    )
select yearid, avg_salary salary_factor,
       round(avg_salary/prior_avg_salary,3) avg_salary_yoy,
        round(salary_factor/prior_salary_factor,3) as salary_factor_yoy
            from averages_and_yoy
order by yearid desc;

- The query, my first pass, on the catcher question.

In [9]:
%%sql

use aaaaaFantasyBaseball;

with annual_batting_performance_salary as
         (
             select playerid,
                    yearid,
                    app_g_c,
                    (bat_h / if(bat_ab = 0, NULL, bat_ab))                                        as bat_avg,
                    ((bat_h + bb) / (bat_ab + bb))                                                as bat_obp,
                    ((bat_1 + bat_2 * 2 + bat_3 * 3 + bat_hr * 4) / if(bat_ab = 0, NULL, bat_ab)) as slg,
                    salary
             from player_performance_year
                      join
                  (select playerid, yearid, avg(salary) as salary
                   from lahmansbaseballdb.salaries
                   group by playerid, yearid) as a
                  using
                      (playerid, yearid)
             where bat_ab >= 100
         ),
 normalized_salary_batting_performance as
     (
         select yearid, playerid,  bat_obp, slg, app_g_c,
                round(salary/normalized_salary_averages.salary_factor,3) as relative_salary from
                  annual_batting_performance_salary join
                    normalized_salary_averages using(yearid)
     )
select
    yearid, playerid, nameLast, nameFirst, slg, relative_salary, round(slg/relative_salary,3) as slg_per_salary
from normalized_salary_batting_performance join lahmansbaseballdb.people using(playerid)
    where app_g_c > 100
    order by slg_per_salary desc
limit 5;

 * mysql+pymysql://dbuser:***@localhost/lahmansbaseballdb
0 rows affected.
5 rows affected.

[(2006, 'mccanbr01', 'McCann', 'Brian', Decimal('0.5724'), 0.118, 4.851),
 (2001, 'pierzaj01', 'Pierzynski', 'A. J.', Decimal('0.4409'), 0.092, 4.793),
 (2000, 'melusmi01', 'Meluskey', 'Mitch', Decimal('0.4866'), 0.108, 4.506),
 (2000, 'estalbo02', 'Estalella', 'Bobby', Decimal('0.4682'), 0.105, 4.459),
 (1993, 'piazzmi01', 'Piazza', 'Mike', Decimal('0.5612'), 0.129, 4.351)]